-- Задание 1
-- Придумайте и создайте еще одну группу. В группе должно быть не менее 25 студентов, 
-- оценки и ФИО студентов должны быть осмысленные. 

-- Сгенерировала информацию о студенте с помощью скрипта на python

-- Добавление данных в таблицы
INSERT INTO student (student_id, surname, name, patronymic, students_group_number, birthday, email) 
VALUES  
(899474, 'Беляков', 'Бронислав', 'Архипович', 'ИВТ-11', date('2004-12-13'), 'bbeljakov@miet.ru'),
(899475, 'Кулаков', 'Мирон', 'Валерьянович', 'ИВТ-11', date('2001-09-01'), 'mkulakov@miet.ru'),
(899476, 'Некрасов', 'Гедеон', 'Иосифович', 'ИВТ-11', date('2001-12-02'), 'gnekrasov@miet.ru'),
(899477, 'Тарасов', 'Стоян', 'Афанасьевич', 'ИВТ-11', date('2003-05-06'), 'starasov@miet.ru'),
(899478, 'Фролов', 'Ульян', 'Валентинович', 'ИВТ-11', date('2001-03-09'), 'ufrolov@miet.ru'),
(899479, 'Власов', 'Панкрат', 'Егорович', 'ИВТ-11', date('2001-07-30'), 'pvlasov@miet.ru'),
(899480, 'Денисов', 'Святополк', 'Гавриилович', 'ИВТ-11', date('2005-11-01'), 'sdenisov@miet.ru'),
(899481, 'Семенов', 'Вадим', 'Феофанович', 'ИВТ-11', date('2005-06-10'), 'vsemenov@miet.ru'),
(899482, 'Уваров', 'Мефодий', 'Вилорович', 'ИВТ-11', date('2002-08-17'), 'muvarov@miet.ru'),
(899483, 'Владимиров', 'Боян', 'Васильевич', 'ИВТ-11', date('2001-07-21'), 'bvladimirov@miet.ru'),
(899484, 'Иванов', 'Митофан', 'Федотович', 'ИВТ-11', date('2004-09-07'), 'mivanov@miet.ru'),
(899485, 'Стрелков', 'Аполлон', 'Авдеевич', 'ИВТ-11', date('2004-06-24'), 'astrelkov@miet.ru'),
(899486, 'Ершов', 'Христофор', 'Чеславович', 'ИВТ-11', date('2006-01-17'), 'hershov@miet.ru'),
(899487, 'Григорьев', 'Ким', 'Дорофеевич', 'ИВТ-11', date('2005-09-19'), 'kgrigorev@miet.ru'),
(899488, 'Родионов', 'Устин', 'Тихонович', 'ИВТ-11', date('2004-09-02'), 'urodionov@miet.ru'),
(899489, 'Яковлев', 'Трофим', 'Борисович', 'ИВТ-11', date('2002-07-09'), 'tjakovlev@miet.ru'),
(899490, 'Шубин', 'Лучезар', 'Ефимьевич', 'ИВТ-11', date('2003-12-27'), 'lshubin@miet.ru'),
(899491, 'Вишняков', 'Вениамин', 'Геннадиевич', 'ИВТ-11', date('2001-09-10'), 'vvishnjakov@miet.ru'),
(899492, 'Тарасов', 'Вацлав', 'Демидович', 'ИВТ-11', date('2001-11-10'), 'vtarasov@miet.ru'),
(899493, 'Юдин', 'Никанор', 'Арсенович', 'ИВТ-11', date('2001-12-04'), 'njudin@miet.ru'),
(899494, 'Симонова', 'Майя', 'Руслановна', 'ИВТ-11', date('2002-03-28'), 'msimonova@miet.ru'),
(899495, 'Никонова', 'Оксана', 'Матвеевна', 'ИВТ-11', date('2003-08-08'), 'onikonova@miet.ru'),
(899496, 'Гаврилова', 'Ангелина', 'Геннадьевна', 'ИВТ-11', date('2001-08-01'), 'agavrilova@miet.ru'),
(899497, 'Сидорова', 'Жанна', 'Михайловна', 'ИВТ-11', date('2004-04-24'), 'zhsidorova@miet.ru'),
(899498, 'Королева', 'Тамара', 'Юрьевна', 'ИВТ-11', date('2003-05-28'), 'tkoroleva@miet.ru');

INSERT INTO student_id (student_id, issue_date, expiration_date) 
VALUES 
(899474, date('2023-08-31'), date('2027-08-31')),
(899475, date('2023-08-31'), date('2027-08-31')),
(899476, date('2023-08-31'), date('2027-08-31')),
(899477, date('2023-08-31'), date('2027-08-31')),
(899478, date('2023-08-31'), date('2027-08-31')),
(899479, date('2023-08-31'), date('2027-08-31')),
(899480, date('2023-08-31'), date('2027-08-31')),
(899481, date('2023-08-31'), date('2027-08-31')),
(899482, date('2023-08-31'), date('2027-08-31')),
(899483, date('2023-08-31'), date('2027-08-31')),
(899484, date('2023-08-31'), date('2027-08-31')),
(899485, date('2023-08-31'), date('2027-08-31')),
(899486, date('2023-08-31'), date('2027-08-31')),
(899487, date('2023-08-31'), date('2027-08-31')),
(899488, date('2023-08-31'), date('2027-08-31')),
(899489, date('2023-08-31'), date('2027-08-31')),
(899490, date('2023-08-31'), date('2027-08-31')),
(899491, date('2023-08-31'), date('2027-08-31')),
(899492, date('2023-08-31'), date('2027-08-31')),
(899493, date('2023-08-31'), date('2027-08-31')),
(899494, date('2023-08-31'), date('2027-08-31')),
(899495, date('2023-08-31'), date('2027-08-31')),
(899496, date('2023-08-31'), date('2027-08-31')),
(899497, date('2023-08-31'), date('2027-08-31')),
(899498, date('2023-08-31'), date('2027-08-31'));